bench_results/run_20260712_182304.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260712_182304.csv
[INFO] Log output: bench_results/run_20260712_182304.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.77ms    7.24ms  62.67ms   72.42%
    Req/Sec   273.63     68.99   530.00     75.88%
  21953 requests in 10.09s, 3.14MB read
Requests/sec:   2176.32
Transfer/sec:    319.06KB