bench_results/run_20260712_182330.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260712_182330.csv
[INFO] Log output: bench_results/run_20260712_182330.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.72ms    6.84ms  66.70ms   75.78%
    Req/Sec   287.37     68.21   574.00     80.88%
  23056 requests in 10.09s, 3.29MB read
Requests/sec:   2284.69
Transfer/sec:    334.28KB

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.11ms    5.65ms  88.53ms   79.09%
    Req/Sec   282.06     47.18   485.00     80.24%
  67526 requests in 30.08s, 9.65MB read
Requests/sec:   2244.63
Transfer/sec:    328.56KB

[INFO] staircase: c=100 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.75ms   11.39ms 228.22ms   91.77%
    Req/Sec   269.38     43.03   747.00     80.69%
  64473 requests in 30.10s, 9.23MB read
Requests/sec:   2141.88
Transfer/sec:    313.96KB

[INFO] staircase: c=200 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.80ms   13.50ms 263.21ms   85.34%
    Req/Sec   278.71     47.04   524.00     80.57%
  66721 requests in 30.10s, 9.55MB read
Requests/sec:   2216.82
Transfer/sec:    324.86KB

[INFO] staircase: c=400 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   176.41ms   24.41ms 300.15ms   82.22%
    Req/Sec   285.71    133.45   700.00     61.11%
  67851 requests in 30.10s, 9.71MB read
Requests/sec:   2254.09
Transfer/sec:    330.42KB

[INFO] staircase: c=800 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   352.16ms   59.68ms 796.98ms   88.19%
    Req/Sec   284.75    166.76     0.87k    64.11%
  67263 requests in 30.07s, 9.62MB read
Requests/sec:   2237.10
Transfer/sec:    327.71KB

[DONE] Benchmark finished.
[DONE] CSV: bench_results/summary_20260712_182330.csv
[DONE] LOG: bench_results/run_20260712_182330.log