bench_results/run_20260720_212023.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260720_212023.csv
[INFO] Log output: bench_results/run_20260720_212023.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   172.55ms  124.73ms 508.29ms   59.91%
    Req/Sec    36.84     20.29   106.00     68.31%
  Latency Distribution
     50%  182.10ms
     75%  255.81ms
     90%  348.92ms
     99%  461.98ms
  2877 requests in 10.09s, 423.19KB read
Requests/sec:    285.19
Transfer/sec:     41.95KB

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   131.09ms   78.24ms 337.48ms   58.79%
    Req/Sec    45.77     18.62   120.00     73.80%
  Latency Distribution
     50%  132.56ms
     75%  192.50ms
     90%  239.25ms
     99%  294.18ms
  10986 requests in 30.11s, 1.57MB read
Requests/sec:    364.83
Transfer/sec:     53.41KB

[INFO] staircase: c=100 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   260.89ms  160.46ms 642.88ms   57.13%
    Req/Sec    46.16     21.51   180.00     69.49%
  Latency Distribution
     50%  266.40ms
     75%  384.50ms
     90%  477.33ms
     99%  578.57ms
  11033 requests in 30.12s, 1.57MB read
Requests/sec:    366.28
Transfer/sec:     53.49KB

[INFO] staircase: c=200 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   438.73ms  350.10ms   1.68s    48.19%
    Req/Sec    59.38     49.18   470.00     85.56%
  Latency Distribution
     50%  474.10ms
     75%  727.58ms
     90%  936.42ms
     99%    1.01s 
  14099 requests in 30.11s, 1.74MB read
  Non-2xx or 3xx responses: 5168
Requests/sec:    468.19
Transfer/sec:     59.12KB

[INFO] staircase: c=400 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   335.84ms  357.98ms   2.00s    79.89%
    Req/Sec   209.78    169.92   815.00     68.64%
  Latency Distribution
     50%  162.03ms
     75%  553.64ms
     90%  948.63ms
     99%    1.27s 
  49505 requests in 30.11s, 4.74MB read
  Socket errors: connect 0, read 0, write 0, timeout 51
  Non-2xx or 3xx responses: 44659
Requests/sec:   1644.30
Transfer/sec:    161.13KB

[INFO] staircase: c=800 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   420.94ms  392.23ms   1.68s    71.98%
    Req/Sec   261.61    144.38     0.91k    66.61%
  Latency Distribution
     50%  246.43ms
     75%  698.86ms
     90%    1.10s 
     99%    1.37s 
  62368 requests in 30.11s, 5.84MB read
  Non-2xx or 3xx responses: 59038
Requests/sec:   2071.08
Transfer/sec:    198.72KB

[DONE] Benchmark finished.
[DONE] CSV: bench_results/summary_20260720_212023.csv
[DONE] LOG: bench_results/run_20260720_212023.log